calamity10110/circuitpython/ports/espressif/boards/custom_esp32s3_devkit/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2025 CircuitPython Contributors
//
// SPDX-License-Identifier: MIT

#pragma once

#define MICROPY_HW_BOARD_NAME       "ESP32-S3 DevKit"
#define MICROPY_HW_MCU_NAME         "ESP32-S3"


#define DEFAULT_I2C_BUS_SCL         (&pin_GPIO9)
#define DEFAULT_I2C_BUS_SDA         (&pin_GPIO8)

#define DEFAULT_SPI_BUS_SCK         (&pin_GPIO36)
#define DEFAULT_SPI_BUS_MOSI        (&pin_GPIO35)
#define DEFAULT_SPI_BUS_MISO        (&pin_GPIO37)

#define DEFAULT_UART_BUS_RX         (&pin_GPIO44)
#define DEFAULT_UART_BUS_TX         (&pin_GPIO43)
